cases/MICP/precipitation/c=8e-1/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


transportModel  Newtonian;
//bio
muf         muf     	 [1 -1 -1 0 0 0 0 ] 1.2e-5;
rhof        rhof         [1 -3 0 0 0 0 0] 1000;
D           D            [0 2 -1 0 0 0 0]  1.6e-9;
Mmax          Mmax         [1 -3 0 0 0 0 0] 60;
ks            ks          [1 -3 0 0 0 0 0] 3.5e-5;
ms            ms          [0 0 -1 0 0 0 0] 3e-5;
mum           mum         [0 0 -1 0 0 0 0] 1.5e-5;
Yxs           Yxs          [0 0 0 0 0 0 0]  4.5e-2;
ops           ops           [0 0 0 0 0 0 0] 1e-5;
C0            C0          [1 -3 0 0 0 0 0] 4e-3;
a             a            [0 0 1 0 0 0 0] 1;
b             b          [0 0 1 0 0 0 0] 1;
c             c          [0 1 0 0 0 0 0] 1;
//pre
Durea           Durea            [0 2 -1 0 0 0 0]  1e-9;
DNH4           DNH4            [0 2 -1 0 0 0 0]  1e-9;
Dca           Dca            [0 2 -1 0 0 0 0]  1e-9;
Dco3           Dco3            [0 2 -1 0 0 0 0]  1e-9;
Ku            Ku          [0 0 -1 0 0 0 0] 8.33e-5;
Kp            Kp          [0 0 -1 0 0 0 0] 0.01;
Km            Km          [1 -3 0 0 0 0 0] 0.301;
KNH4            KNH4          [1 -3 0 0 0 0 0] 1e30;
rhoCaCO3            rhoCaCO3          [1 -3 0 0 0 0 0] 1620;
MWCaCO3             MWCaCO3            [0 0 0 0 0 0 0] 100.869;
rhoMb               rhoMb              [1 -3 0 0 0 0 0] 1620;
// ************************************************************************* //
